# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Algoritmos
#+Subtitle: *INF01202*
#+Author: Prof. Lucas Mello Schnorr
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS: title:nil H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel.tex}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{systeme}

#+latex: \newcommand{\mytitle}{Arquivos}
#+latex: \mytitleslide

* Tipos de Arquivo

*Binário*
- Uma sequência de bytes que não pode ser interpretada em ASCII
- Em geral, um padrão de bits tal qual aparece na memória principal
  #+attr_latex: :options fontsize=\tiny
  #+begin_src C
  #include <stdio.h>
  float f;
  f = -1298721.72672;
  FILE *fp = fopen("arquivo.bin", "w");
  fwrite(&f, sizeof(float), 1, fp);
  #+end_src

  #+RESULTS:

  #+attr_latex: :options fontsize=\tiny
  #+begin_src shell :results output :exports results
  wc -c arquivo.bin
  xxd -l 4 -b arquivo.bin
  #+end_src

  #+RESULTS:
  : 4 arquivo.bin
  : 00000000: 00001110 10001001 10011110 11001001                    ....
  Mais informações sobre codificação =float=: \\
  https://en.wikipedia.org/wiki/IEEE_754

#+latex: \pause\vfill

*Texto*
- Uma sequência de bytes interpretável em ASCII
- Podemos abrir com um editor de texto puro

